Repository: giellalt/corpus-smj
Catalog: tmx/swe/facta/samernas.se/bargge.html.tmx
Source language: smj
Languages: swe

source: Sadj rektåvrrå 11 biejves guov. 2013
swe: ingrid. parfa (a) samernas. se

source: Ekonomiddjaåvdåsvásstediddje
swe: IT-ansvarig

source: Ekonomiddja viehkediddje
swe: labba (a) samernas. se

source: IT-åvdåsvásstediddje
swe: Slöjdlärare skinn / textil

source: Jon Tomas Utsi
swe: rensberg (a) samernas. se

source: Åhpadiddje
swe: nils-johan.labba(@)samernas.se

source: Duodjeåhpadiddje sassne / tekstijlla
swe: Slöjdlärare skinn / textil

source: Giellaåhpadiddje julevsámegiellaj
swe: gun. aira (a) samernas.

source: Gun Aira
swe: se

source: Sara Aira Fjällström
swe: Språklärare sydsamiska

source: Giellaåhpadiddje oarjjelsámegiellaj
swe: reinie. fjallstrom (a) samernas. se

source: Giellaåhpadiddje nuorttasámegiellaj
swe: labba (a) samernas. se

source: Åhpadiddje ekonomiddjaj
swe: Lärare ekonomi

source: Prosjäktatjuottjodiddje
swe: blind (a) samernas. se

source: Hoajttár
swe: edmond.

source: Dievnastiddje – äjgátfriddja
swe: baer (a) samernas. se

source: Dievnastiddje
swe: linda.

source: Giella
swe: se

source: Duodje
swe: Ekonomiansvarig – Föräldraledig

source: Boatsojäládus
swe: helen.holmbom(@)samernas.se

source: Sáme biebbmo
swe: Rennäringslinje
